Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
/*
 * BMS_TLE9012.c
 *
 *	Library for TLE9012 Li-Ion battery monitoring and balancing system IC.
 *	Created by R. Santeler @ Infineon 2024
 *
 *  VERSION 1.00
 *
 *  USAGE (see "example.c_" for details):
 * 			- Implement target/uC specific functions in tle9012_target.h/.c
 * 			- Implement ISR for Interrupt and its behavior in main code (see examples.c_ for hint on how to implement. Note that the ERR interrupt pin must be configured before it is active)
 * 			- Configure number of expected nodes, etc in tle9012_registers.h SETTINGS section. NOTE: This library was developed on a single IC system. Multi-node init and broadcast commands are implemented but untested.
 * 			- Init TL9012 with TLE9012_Init() command and use set...() commands and tle9012_writeRegisterByIndex to configure it
 * 			- Use library commands to write (tle9012_writeRegisterByIndex()) and read (tle9012_readRegisterByIndex()) register data via the queue. Use checkRegisterQueued_tle9012(), checkRegisterReady_tle9012 and checkRegisterError_tle9012 before requesting the register data by getRegisterCacheDataByIndex_tle9012().
 * 			- Convert functions like tle9012_convertBlockVoltage or tle9012_convertPrimaryCellVoltages write their result into the tle9012_nodes[] array. Here the index represents the node ID-1 (e.g.: NoteID 1 is on index 0, NodeID 2 is on 1, etc)
 * 			- Call tle9012_manageQueue(1) and tle9012_manageInterpreter() every cycle. It handles the actual TLE9012 RX and TX and keeps watchdog running!
 * 			- The function parameter isBlocking  can be used to execute a function and wait till the result from the tle9012 has been received (all queue items done).
 * 			- The function parameter isBroadcast can be used to read/write from/to all configured nodes. NOTE: This library was developed on a single IC system. Multi-node init and broadcast commands are implemented but untested.
 *
 *  NOTE:	Always use this library in combination with the datasheet/user manual of the chip. Due to the vast amount of functions and subsystems in the IC the content of its documentation is essential to use this library properly.
 *  NOTE:	This library was developed on a single IC system. Multi-node init and broadcast commands are implemented but untested.
 *  NOTE:	Never directly write to or read from TLE9012 UART. Everything must be passed thru Queue/Interpreter system.
 *  NOTE:	Access to many functions of the IC are simplified with "high level" functions in this file. However, due to the vast possibilities of the IC some functions must be addressed by lower level functions, found in registers.c/.h. E.g. use tle9012_writeRegisterByIndex and tle9012_readRegisterByIndex
 *  NOTE:	The content of registers.c/.h consists of helpful lower level definitions and helper functions needed for the higher and lower level features
 *  NOTE:	Muti-read configuration must be set with the function tle9012_writeMultiReadConfig! Ignoring this will break the queue/interpreter system! See description of tle9012_writeMultiReadConfig()!
 *  NOTE:	The register GEN_DIAG must be used to get most errors. Use tle9012_clearProblemDetected() and tle9012_clearStatusFlags(1, 0, 0) to clear errors. In addition multiple bitmaps for cell errors are available.
 *  NOTE:	tle9012_problemDetected() must be used for some functions to check if an action was successful (see description of function). After the check clearProblemDetected() should be used to reset the flag (also clearStatusFlags() resets this). Also the general error bit in every write request is requested with this (generalDiagnosticProblemDetected - see interpreter)
 *
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related materials ("Software") is owned by Cypress Semiconductor Corporation or one of its affiliates ("Cypress") and is protected by and subject to worldwide patent protection (United States and foreign), United States copyright laws and international treaty provisions.  Therefore, you may use this Software only as provided in the license agreement accompanying the software package from which you obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive, non-transferable license to copy, modify, and compile the Software source code solely for use in connection with Cypress's integrated circuit products.  Any reproduction, modification, translation, compilation, or representation of this Software except as specified above is prohibited without the express written permission of Cypress.
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress reserves the right to make changes to the Software without notice. Cypress does not assume any liability arising out of the application or use of the Software or any product or circuit described in the Software. Cypress does not authorize its products for use in any products where a malfunction or failure of the Cypress product may reasonably be expected to result in significant property damage, injury or death ("High Risk Product"). By including Cypress's product in a High Risk Product, the manufacturer of such system or application assumes all risk of such use and in doing so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <ctype.h>
#include <stdlib.h> // includes strtol
#include <math.h>

#include "BMS_TLE9012.h"
#include "tle9012_registers.h"
#include "tle9012_target.h"
#include "tle9012_data.h"
#include "tle9012_queue.h"
#include "tle9012_interpreter.h"

#define DEBUGPRINTF_READ_WRITE(p_frm, ...)		//DEBUGPRINTF(p_frm, ##__VA_ARGS__)

uint8_t tle9012_problemDetected = 0; // Used to check if an action was successful and if failure flags are set
uint8_t generalDiagnosticProblemDetected = 0;


// Make indices available for debug
extern uint16_t receive_index;
extern uint16_t interpreter_index;
extern uint8_t queue_index_current;
extern uint8_t queue_index_latest;



//****************************************************************************
// tle9012_initUART
//
// initialize the UART device. Must be done at start of main.
// Returns 0 if successful
//****************************************************************************
uint8_t tle9012_initUART(void)
{
	return uartInit();
}

//****************************************************************************
// tle9012_deviceInit - Initialize all TLE9012 devices. Sends wakeup, assigns all IDs up until TLE9012_NODES_SIZE, sets initial values and performs configuration updates if device is reset or re-woken
//
// reinitializeConfig			-> If this is set to 1 all configuration registers are written from shadow cache back to the devices.
//                         		   This is necessary e.g. if device went to sleep and lost its settings (this way the configuration does not need to be re-performed)
//****************************************************************************
void tle9012_deviceInit(uint8_t reinitializeConfig)
{
	DEBUGPRINTF("TLE9012 Init:\r\n");

	// Reset queue and interpreter
	resetQueue();
	resetInterpreter();

	// Wakeup first device - will wake all
	tle9012_sendWakeup(1);

