Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
	// Store time of wake (equal to watchdog refresh)
	timeLastWatchdogRefresh = TIMER_COUNTER_1MS;

	// Assign all devices and reset settings
	for(uint8_t i = 1; i <= TLE9012_NODES_SIZE; i++){
		//DEBUGPRINTF("\tAssign ID to node %d\r\n", i);
		tle9012_assignID(i, IS_FINAL_NODE, ENABLE_ALL_ADC);

		// Fake reply frame/byte (seems like write to node 0 do not trigger reply)
		addToReceiveRingBuffer_tle9012(0);

		/// Apply init configuration
		// Set all ready bits to 1 and all error bits to 1
		tle9012_nodes[i-1].reg_items_ready_bitmap = UINT64_MAX;
		tle9012_nodes[i-1].reg_items_error_bitmap = UINT64_MAX;
		tle9012_nodes[i-1].reg_items_queued_bitmap = 0;

		// Write all configuration registers from shadow cache back to the devices if needed
		if(reinitializeConfig){
			tle9012_writeRegisterByIndex(i, PART_CONFIG, 	  tle9012_nodes[i-1].reg_data[PART_CONFIG] , 0, 0);
			tle9012_writeRegisterByIndex(i, MEAS_CTRL,   	  tle9012_nodes[i-1].reg_data[MEAS_CTRL]   , 0, 0);
			tle9012_writeRegisterByIndex(i, OP_MODE,     	  tle9012_nodes[i-1].reg_data[OP_MODE]     , 0, 0);
			tle9012_writeRegisterByIndex(i, FAULT_MASK,  	  tle9012_nodes[i-1].reg_data[FAULT_MASK]  , 0, 0);
			tle9012_writeRegisterByIndex(i, OL_OV_THR,   	  tle9012_nodes[i-1].reg_data[OL_OV_THR]   , 0, 0);
			tle9012_writeRegisterByIndex(i, OL_UV_THR,   	  tle9012_nodes[i-1].reg_data[OL_UV_THR]   , 0, 0);
			tle9012_writeRegisterByIndex(i, TEMP_CONF,   	  tle9012_nodes[i-1].reg_data[TEMP_CONF]   , 0, 0);
			tle9012_writeRegisterByIndex(i, INT_OT_WARN_CONF, tle9012_nodes[i-1].reg_data[INT_OT_WARN_CONF], 0, 0);
			tle9012_writeRegisterByIndex(i, BAL_PWM,   	 	  tle9012_nodes[i-1].reg_data[BAL_PWM]     , 0, 0);
			tle9012_writeRegisterByIndex(i, BAL_CURR_THR,	  tle9012_nodes[i-1].reg_data[BAL_CURR_THR], 0, 0);
			tle9012_writeRegisterByIndex(i, BAL_SETTINGS,     tle9012_nodes[i-1].reg_data[BAL_SETTINGS], 0, 0);
			tle9012_writeRegisterByIndex(i, RR_CONFIG,   	  tle9012_nodes[i-1].reg_data[RR_CONFIG]   , 0, 0);

			tle9012_writeRegisterByIndex(i, MULTI_READ_CFG,   tle9012_nodes[i-1].reg_data[MULTI_READ_CFG], 0, 0);

			DEBUGPRINTF("\t Reinit TLE9012 config registers:\r\n");
		}
	}

	// Make sure queue and interpreter are finished
	do{
		tle9012_manageInterpreter();
	}while(tle9012_manageQueue(1) != QUEUE_FINISHED);
}

//****************************************************************************
// tle9012_sendWakeup - Sends the wakeup pattern to the ICs (not ID specific)
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
//**********************************************************************
void tle9012_sendWakeup(uint8_t nodeID)
{
    if (isEnabled()) {
    	// Compose write frame and send data
		tle9012_tx_buffer[0] = FRAME_WAKE;
		tle9012_tx_buffer[1] = FRAME_WAKE;
		tle9012_tx_buffer_size = 2;
		uartWrite(tle9012_tx_buffer_size, 1);
		tle9012_nodes[nodeID-1].timeLastCommandSent = TIMER_COUNTER_1MS;
		DEBUGPRINTF("TLE9012 WakeUp: NodeID %d\r\n", nodeID);

		timeLastWatchdogRefresh = TIMER_COUNTER_1MS;

		// Wait wakeup is done
		DELAY_MS(10); // TODO: check if this is necessary
    }
    else {
        tle9012_problemDetected = 1;
        DEBUGPRINTF("\r\n[ERROR]: sendWakeup - Device is disabled\r\n");
    }
}

//****************************************************************************
// tle9012_assignID - After first wakeup every TLE9012 node in chain must be assigned a ID starting from 1
//			  		  The last node must be assigned with the FinalNode flag because only it creates the reply frame.
//			  		  Without the FinalNode set right there will never be any answer of any tle9012!
// nodeID		 -> The ID that shall be assigned. Range 1 to TLE9012_NODES_SIZE
// isFinalNode   -> If 1 this will be marked as the last node
// enableAllADC  -> If 1 PCVM is done for each channel, independent of PART_CONFIG setup (ignore PART_CONFIG)
//**********************************************************************
void tle9012_assignID(uint8_t nodeID, uint8_t isFinalNode, uint8_t enableAllADC)
{
	DEBUGPRINTF("TLE9012 AssignID: NodeID %d\r\n", nodeID);

	// Reset node ID of object(must be 0 to address the next non assigned node)
	tle9012_nodes[nodeID-1].ID = 0;

	// Set ID in data
	uint16_t data = nodeID;
	//DEBUGPRINTF("\r\n");

	// If this is the final node add flag
	if(isFinalNode == 1){
		DEBUGPRINTF("\tAssign final node to ID %d\r\n", nodeID);
		data |= FN__FN ;
	}

	// Enable ADCs
	if(enableAllADC == 1){
		DEBUGPRINTF("\tEnable all ADCs on node ID %d\r\n", nodeID);
		data |= EN_ALL_ADC__ALL_ADC;
	}

	// Send assign message out
	sendWrite(&tle9012_nodes[nodeID-1], reg_items[CONFIG_MAIN].address, data, 0);

	DELAY_MS(10); // TODO: check if this is necessary

	// Store ID
	tle9012_nodes[nodeID-1].ID = nodeID;
}

//****************************************************************************
// blockTillQueueFinished - This will block until the queue is finished and a register index is ready.
//		Will execute manageQueue and manageInterpreter continuously until conditions are met or timeout happened.
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// reg_idx		-> The index of the register that shall be checked see register.h definitions.  E.g. PART_CONFIG etc
//
// Returns the requestResult: REQUEST_OK, REQUEST_ERROR, REQUEST_DONE_BUT_REGISTER_NOT_READY or REQUEST_TIMEOUT
//**********************************************************************
static inline requestResult blockTillQueueFinished(uint8_t nodeID, uint8_t reg_idx){
	QueueResult result;

	// Try to wait for max TIMEOUT_COMMAND + safety and manage queue and interpreter until the queue is finished
	uint32_t startTime = TIMER_COUNTER_1MS;
	for(uint32_t i = 0; i<UINT32_MAX; i++){
		// Execute management of queue and interpreter
		result = tle9012_manageQueue(1);
		tle9012_manageInterpreter();
		// If queue is finished with all items the request should be ready
		if(result == QUEUE_FINISHED){
			DEBUGPRINTF_READ_WRITE("Queue finished after %ld loops and %ld ms\r\n", i, (uint32_t)(TIMER_COUNTER_1MS - startTime));
			// Check if result is not ready, has an error or else is OK
			if(checkRegisterReady_tle9012(nodeID, reg_idx, 0) == 0){
				DEBUGPRINTF("[ERROR]: Queue finished, but register not ready on Node %d with reg_idx %d\r\n", nodeID, reg_idx);
				return REQUEST_DONE_BUT_REGISTER_NOT_READY;
			}
			else if(checkRegisterError_tle9012(nodeID, reg_idx, 0) == 1){
				DEBUGPRINTF("[ERROR]: Queue finished, but register has error on Node %d with reg_idx %d\r\n", nodeID, reg_idx);
				return REQUEST_ERROR;
			}
			else
				return REQUEST_OK;
			//break;
		}
		else if (result == QUEUE_TIMEOUT){
			DEBUGPRINTF("[ERROR]: Request queue timeout on Node %d with reg_idx %d\r\n", nodeID, reg_idx);
			return REQUEST_TIMEOUT;
		}


		// If blocking takes to long stop execution
		if(TIMER_COUNTER_1MS > (startTime + TIMEOUT_COMMAND+50)){
			DEBUGPRINTF("[ERROR]: Request blocking timeout after %ld ms (%ld loops) on Node %d with reg_idx %d (receive_idx %d, interp_idx %d, queue_idx_cur %d, queue_idx_last %d)\r\n", (uint32_t)(TIMER_COUNTER_1MS - startTime), i, nodeID, reg_idx, receive_index, interpreter_index, queue_index_current, queue_index_latest);
			//return REQUEST_TIMEOUT;
		}
		// Block 1ms at a time
		//DELAY_MS(1);
	}

	// Should never get here
	DEBUGPRINTF("[ERROR]: blockTillQueueFinished reached end - this should never be\r\n");
	return REQUEST_ERROR;
}

//****************************************************************************
// tle9012_writeRegisterByIndex - Set all 16 bits of a register on a node directly. Register cache will ultimately be updated by the interpreter if a positive reply of the node is received.
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// reg_idx		-> The index of the register that shall be set see register.h definitions.  E.g. PART_CONFIG etc
// data     	-> The full 16 bit data of the register. Previous state will be overwritten completely - Note: Always check registers.h to find the right setting and use the defined values
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
// isBroadcast  -> If set to 1 this will effect all nodes
//
// Note: NEVER WRITE DIRECTLY TO ONE OF THE FOLLOWING REGISTER INDECIES
// 		 MULTI_READ 		- Does not allow direct write
// 		 MULTI_READ_CFG		- Must be written with tle9012_writeMultiReadConfig(). Direct write and subsequent read of MULTI_READ will result in catastrophic bugs (e.g. simultaneous UART TX and RX, overflows, etc) -> see tle9012_writeMultiReadConfig() description
//
// Note: With this you cannot queue a write and a readof the same register at the same time. Use a state machine to switch between write and read when checkRegisterQueued_tle9012 returns 0;
//
// Returns the requestResult. If the result is REQUEST_OK the command can be considered successful. Else it can neither be considered successful nor unsuccessful (reply could be corrupted).
//**********************************************************************
requestResult tle9012_writeRegisterByIndex(uint8_t nodeID, uint8_t reg_idx, uint16_t data, uint8 isBlocking, uint8_t isBroadcast){
	// Debug
	//if(reg_idx != GEN_DIAG){
	//	DEBUGPRINTF_READ_WRITE("Write node %d register index %d with data 0x%04X, blocking %d and isBroadcast %d ready %d\r\n", nodeID, reg_idx, data, isBlocking, isBroadcast, checkRegisterReady_tle9012(nodeID, reg_idx, isBroadcast));
	//}

	// Check if a write request is already in queue (it is when ready bit of register is 0 - not ready)
	if(checkRegisterReady_tle9012(nodeID, reg_idx, isBroadcast) == 0){
		return REQUEST_REGISTER_NOT_READY;
	}
	else if(checkRegisterQueued_tle9012(nodeID, reg_idx, isBroadcast) == 1){
		return REQUEST_REGISTER_ALREADY_QUEUED;
	}
	else{
		QueueResult queueResult;

		// Add request to queue
		queueResult = addToQueue_tle9012(nodeID, 1, reg_idx, data, isBroadcast);
		if(queueResult != QUEUE_SUCCESS){
			return REQUEST_ADD_FAILED;
		}

		// If blocking was requested, wait till the result is finished
		if(isBlocking == 1){
			return blockTillQueueFinished(nodeID, reg_idx);
		}
		else{
			return REQUEST_ADDED;
		}
	}

	// The function can only get here if blocking was 1 and the queue request did not finish in time
	return REQUEST_TIMEOUT;
}

//****************************************************************************
// tle9012_readRegisterByIndex - Read all 16 bits of a register on a node directly. Register cache will ultimately be updated by the interpreter if a positive reply of the node is received.
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// reg_idx		-> The index of the register that shall be set see register.h definitions.  E.g. PART_CONFIG etc
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
// isBroadcast  -> If set to 1 this will effect all nodes
//
// Note: Register index MULTI_READ will be treated differently but can be used the same way as all others...
//       BUT: Using MULTI_READ without proper prior use of tle9012_writeMultiReadConfig() will result in catastrophic bugs (e.g. simultaneous UART TX and RX, overflows, etc) -> see tle9012_writeMultiReadConfig() description
//
// Note: With this you cannot queue a write and a readof the same register at the same time. Use a state machine to switch between write and read when checkRegisterQueued_tle9012 returns 0;
//
// Returns the requestResult. If the result is REQUEST_OK the command can be considered successful. Else it can neither be considered successful nor not successful (reply could be corrupted).
//**********************************************************************
requestResult tle9012_readRegisterByIndex(uint8_t nodeID, uint8_t reg_idx, uint8 isBlocking, uint8_t isBroadcast){
	// Debug
	if(reg_idx != GEN_DIAG){
		DEBUGPRINTF_READ_WRITE("Read  node %d register index %d blocking %d and isBroadcast %d\r\n", nodeID, reg_idx, isBlocking, isBroadcast);
	}
	// Check if a read request is already in queue (it is when ready bit of register is 0 - not ready)
	if(checkRegisterReady_tle9012(nodeID, reg_idx, isBroadcast) == 0){
		return REQUEST_REGISTER_NOT_READY;
	}
	else if(checkRegisterQueued_tle9012(nodeID, reg_idx, isBroadcast) == 1){
		return REQUEST_REGISTER_ALREADY_QUEUED;
	}
	else{
		QueueResult queueResult;

		// Add request to queue
		queueResult = addToQueue_tle9012(nodeID, 0, reg_idx, 0, isBroadcast);
		if(queueResult != QUEUE_SUCCESS){
			return REQUEST_ADD_FAILED;
		}

		// If blocking was requested, wait till the result is finished
		if(isBlocking == 1){
			return blockTillQueueFinished(nodeID, reg_idx);
		}
		else{
			return REQUEST_ADDED;
		}
	}

	// The function can only get here if blocking was 1 and the queue request did not finish in time
	return REQUEST_TIMEOUT;
}


//****************************************************************************
// tle9012_writeMultiReadConfig - Takes the select properties of MULTI_READ_CFG, stores which registers will be requested and send the write command.
// NOTE: NEVER CHANGE MULTI_READ_CFG WITHOUT THIS FUNCTION! WHEN MULTI_READ IS QUEUED IT WILL WAT FOR EXACTLY WHATS BEEN SET HERE (too less -> waits for something that will never come, too much will receive more while already sending next = collision)
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// ...__sel		-> Use the MULT_READ_CFG macros in register.h like: PCVM_SEL__RES_CELL_11_0, BVM_SEL__RESULT, EXT_TEMP_SEL__RES_TMP0_4, EXT_TEMP_R_SEL__R_DIAG_RES, INT_TEMP_SEL__INT_TMP_RES, SCVM_SEL__RESULT, STRESS_PCVM_SEL__RESULT (triggers all possible multi read registers). Use intellisense on parameter name
//                 Note: pcvm_sel = 0->No PCVM read, PCVM_SEL__RES_CELL_11->Only cell 11 PCVM read, PCVM_SEL__RES_CELL_11_0->All cell PCVM read, 4->Cell 11-8 PCVM read (not all combinations are mentioned in data sheet, inbetweens are possible)
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
//
// Returns the requestResult from tle9012_writeRegisterByIndex
//**********************************************************************
requestResult tle9012_writeMultiReadConfig(uint8_t nodeID, uint16_t pcvm_sel, uint16_t bvm_sel, uint16_t ext_temp_sel, uint16_t ext_temp_r_sel, uint16_t int_temp_sel, uint16_t scvm_sel, uint16_t stress_pcvm_sel, uint8 isBlocking){
	uint8_t num_list_items = 0;

	// For each register that will be read store its reg index inside the list
    for(uint8_t i = 0; i<pcvm_sel; i++){ 		// Store each cell that will be read in PCVM as bit
    	multi_read_cfg_reg_idx_list[num_list_items] = PCVM_11-i;
    	num_list_items++;
	}
    if(bvm_sel != 0){
    	multi_read_cfg_reg_idx_list[num_list_items] = BVM;
    	num_list_items++;
    }
    uint8_t num_temp = ext_temp_sel >> 5;
    for(uint8_t i = 0; i<num_temp; i++){    // Store each temp sensor that will be read in as bit
    	multi_read_cfg_reg_idx_list[num_list_items] = EXT_TEMP_0+i;
    	num_list_items++;
	}
    if(ext_temp_r_sel != 0){
    	multi_read_cfg_reg_idx_list[num_list_items] = EXT_TEMP_R_DIAG;
    	num_list_items++;
    }
    if(int_temp_sel != 0){
    	multi_read_cfg_reg_idx_list[num_list_items] = INT_TEMP;
    	num_list_items++;
    }
    if(scvm_sel != 0){
    	multi_read_cfg_reg_idx_list[num_list_items] = SCVM_HIGH;
    	num_list_items++;
    	multi_read_cfg_reg_idx_list[num_list_items] = SCVM_LOW;
    	num_list_items++;
    }
    if(stress_pcvm_sel != 0){
    	multi_read_cfg_reg_idx_list[num_list_items] = STRESS_PCVM;
    	num_list_items++;
    }

    // Store number of elements in list
    multi_read_cfg_reg_idx_list_num = num_list_items;

    // Print debug
	//for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++)
	//	DEBUGPRINTF("MultiRead %d: Index %d\r\n", i, multi_read_cfg_reg_idx_list[i]);

    // Write multi read config
    return tle9012_writeRegisterByIndex(nodeID, MULTI_READ_CFG, pcvm_sel | bvm_sel | ext_temp_sel | ext_temp_r_sel | int_temp_sel | scvm_sel | stress_pcvm_sel, isBlocking, 1);
}



//****************************************************************************
// tle9012_setConfig - Set one certain config in a register. Usually it is better to use tle9012_writeRegisterByIndex() and write the whole register as needed.
// Note: The register must be read before this is used! This function will use the last read result in shadow register for the rest of the settings.
//       Always check registers.h to find the right subreg and setting and use the defined value.
//		 Some settings can be found on multiple positions of the register (e.g. bitmaps for cell errors or balancing). These must be constructed manually (e.g. 0b0000000000100000)
// Example: requestResult res = tle9012_setConfig(1, RR_CONFIG__M_NR_ERR_BAL_OC, M_NR_ERR_BAL_OC__DISABLE , 1, 0);
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// subreg       -> The subreg_item of the setting that shall be changed e.g. PART_CONFIG__EN_CELLi
// setting      -> The setting that shall be set to above subregister   e.g. EN_CELLi__NO_CELL_ATTACHED  - Note: Always check registers.h to find the right setting and use the defined value
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
// isBroadcast  -> If set to 1 this will effect all nodes
//**********************************************************************
requestResult tle9012_setConfig(uint8_t nodeID, subreg_item subreg, uint16_t setting, uint8_t isBlocking, uint8_t isBroadcast)
{
    uint16_t reg_data;

	// Check if setting bits are in mask
	if (((subreg.mask | setting) & ~subreg.mask) == 0)
	{
		// Get current state of register
		reg_data = getRegisterCacheDataByIndex_tle9012(nodeID, subreg.reg_index);
		// Clear subregister bits
		reg_data &= ~subreg.mask;
		// Set setting bits
		reg_data |= setting;

