Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
		// Write whole register
		requestResult res = tle9012_writeRegisterByIndex(nodeID, subreg.reg_index, reg_data, isBlocking, isBroadcast);

		// Return result of register write
		return res;
	}

	// Else return error
	DEBUGPRINTF("[ERROR]: Tried to set bits out of subregister mask (wrong setting for subreg)\r\n");
	return REQUEST_ERROR;
}

//****************************************************************************
// tle9012_checkConfig - Check if one certain config is set in a register.
// Note: The register must be read before this is used! This function will use the last read result in shadow register for the compare.
//       Always check registers.h to find the right subreg and setting and use the defined value.
//		 Some settings can be found on multiple positions of the register (e.g. bitmaps for cell errors or balancing). These must be constructed manually (e.g. 0b0000000000100000)
// Example: uint8_t res = tle9012_checkConfig(1, RR_CONFIG__M_NR_ERR_BAL_OC, M_NR_ERR_BAL_OC__ENABLE, 1, 0);
//
// nodeID		-> The ID of the node that shall be checked. Range 1 to TLE9012_NODES_SIZE
// subreg       -> The subreg_item of the setting that shall be changed e.g. PART_CONFIG__EN_CELLi
// setting      -> The setting that shall be set to above subregister   e.g. EN_CELLi__NO_CELL_ATTACHED  - Note: Always check registers.h to find the right setting and use the defined value
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
// isBroadcast  -> If set to 1 this will effect all nodes
//
// Return 0 if setting is not active, 1 if setting is active and 2 if an error occured
//**********************************************************************
uint8_t tle9012_checkConfig(uint8_t nodeID, subreg_item subreg, uint16_t setting, uint8_t isBlocking, uint8_t isBroadcast)
{
    uint16_t reg_data;

	// Check if setting bits are in mask
	if (((subreg.mask | setting) & ~subreg.mask) == 0)
	{
		// Get current state of register
		reg_data = getRegisterCacheDataByIndex_tle9012(nodeID, subreg.reg_index);
		// Get only bits in mask
		reg_data &= subreg.mask;
		// If the remaining bits are the same as the wanted setting bits
		if(reg_data == setting){
			return 1;
		}
		else{
			return 0;
		}

	}

	// Else return error
	DEBUGPRINTF("[ERROR]: Tried to check bits out of subregister mask (wrong setting for subreg)\r\n");
	return 2;
}






//****************************************************************************
// tle9012_clearStatusFlags - Try to reset errors and check if they return
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used
// isBroadcast  -> If set to 1 this will effect all nodes
//****************************************************************************
requestResult tle9012_clearStatusFlags(uint8_t nodeID, uint8_t isBlocking, uint8_t isBroadcast)
{
	return tle9012_writeRegisterByIndex(1, GEN_DIAG, 0x0000, isBlocking, isBroadcast);
}


//****************************************************************************
// tle9012_readAllRegistersToCache
//
// If multiple registers shall be read/written use this beforehand
// The register data is stored in tle9012_node.reg_data[reg_index]
//
// nodeID		-> The ID of the node that shall be changed. Range 1 to TLE9012_NODES_SIZE
// isBlocking	-> Wait until the result is ready or error, otherwise the command will only be queued. This will block the CPU, but if this returns REQUEST_OK the result can directly be used.
// isBroadcast  -> If set to 1 this will effect all nodes. NOTE: This might overflow queue or ring buffer for multiple nodes! Must be extend as needed
//
// Returns REQUEST_OK if all registers where read/queued successful. If errors occur only the last error is returned.
//****************************************************************************
requestResult tle9012_readAllRegistersToCache(uint8_t nodeID, uint8_t isBlocking, uint8_t isBroadcast){  // TODO does not work in Broadcast
	requestResult result = REQUEST_OK;
	requestResult tempResult;
	// Read all registers except the last one non-blocking
	for(uint8_t i = 0; i < NUM_REGISTERS-1; i++){
		if(i != MULTI_READ){
			tempResult = tle9012_readRegisterByIndex(nodeID, i, isBlocking, isBroadcast);
			if(tempResult != REQUEST_OK)
				result = tempResult;
		}
	}
	// Read the last one blocking if requested
	tempResult = tle9012_readRegisterByIndex(nodeID, NUM_REGISTERS-1, isBlocking, isBroadcast);
	if(tempResult != REQUEST_OK)
		result = tempResult;

	// Return result
	return result;
}


//****************************************************************************
// tle9012_readPrimaryCellVoltages
//
// Read and convert all of the Primary Cell Voltage channels and store results in tle9012_node item.
// Note: The PCVM_BIT_DIVIDER must be adjusted if the default precision of 16bit changed.
// Note: The channel must be activated and the measurement must be triggered before it can be read.
//
// node			 -> The tle9012_node object representing one TLE9012 instance
// ignoreCellMap -> Each bit (from 0 LSB to 11 MSB) of this mask represents a cell. If set to 1 the result will not be converted for this cell.
// toCellIdx	 -> The highest cell index that shall be read (e.g. 2 reads cell 0,1 and 2). Maximum is 11 - equals all 12 cells. NO LOGIC CHECK IN PLACE - HIGHER NUMBER WILL RESULT IN OVERFLOW
// checkIfQueued -> Will not perform the action if the used PCVM_x register is currently queued
//
// Result is stored in tle9012_node.cell_voltages[cellsIdx]
//****************************************************************************
requestResult tle9012_convertPrimaryCellVoltages(uint8_t nodeID, uint16_t ignoreCellMap, uint8_t toCellIdx, uint8_t checkIfQueued){
	requestResult res = REQUEST_OK;

	// Check every cell
	uint16_t compareBit = 1;
	for(uint16_t i = 0; i <= toCellIdx; i++){
		// If current cell is not marked to be ignored...
		if((ignoreCellMap & (compareBit << (i))) == 0){
			// ... read cell data
			tle9012_convertPrimaryCellVoltageByIndex(nodeID, i, checkIfQueued);
			if(res != REQUEST_OK){
				return res;
			}
			//printf("Update %d \r\n", i);
		}
		else{
			//printf("I %d\r\n", i);
		}
	}

	return res;
}

//****************************************************************************
// tle9012_readPrimaryCellVoltageByIndex
//
// Read and convert one of the Primary Cell Voltage channels and store result in tle9012_node item
// Note: The PCVM_BIT_DIVIDER must be adjusted if the default precision of 16bit changed.
// Note: The channel must be activated and the measurement must be triggered before it can be read.
//
// node			-> The tle9012_node object representing one TLE9012 instance
// cellsIdx		-> Index of the cell that shall be read. Maximum is 11 - equals all 12 cells. NO LOGIC CHECK IN PLACE - HIGHER NUMBER WILL RESULT IN OVERFLOW
// checkIfQueued-> Will not perform the action if the used PCVM_x register is currently queued to be read
//
// Result is stored in tle9012_node.cell_voltages[cellsIdx]
//****************************************************************************
requestResult tle9012_convertPrimaryCellVoltageByIndex(uint8_t nodeID, uint8_t cellsIdx, uint8_t checkIfQueued){
	// If register is not ready or on error state return error
	if(checkRegisterReady_tle9012(nodeID, PCVM_0 + cellsIdx, 0) != 1)
		return REQUEST_REGISTER_NOT_READY;
	else if(checkIfQueued == 1 && checkRegisterQueued_tle9012(nodeID, PCVM_0 + cellsIdx, 0) == 1)
		return REQUEST_REGISTER_ALREADY_QUEUED;
	else if(checkRegisterError_tle9012(nodeID, PCVM_0 + cellsIdx, 0) != 0)
		return REQUEST_ERROR;

	// Read register
	uint16_t cellVoltageRaw = 0;

