Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
	// Get result
	cellVoltageRaw = getRegisterCacheDataByIndex_tle9012(nodeID, PCVM_0 + cellsIdx);

	// Convert register data
	tle9012_nodes[nodeID-1].cell_voltages[cellsIdx] = (int16_t)(((PCVM_FSR/PCVM_BIT_DIVIDER) * (double)cellVoltageRaw)*1000.0);

	// Return ok
	return REQUEST_OK;
}

//****************************************************************************
// tle9012_convertBlockVoltage
//
// Read and convert one of the Block Voltage BVM and store result in tle9012_node item
// Note: BVM_BIT_DIVIDER must be adjusted if the default precision of 16bit changed.
//
// node			-> The tle9012_node object representing one TLE9012 instance
// checkIfQueued-> Will not perform the action if the used BVM register is currently queued to be read
//
// Result is stored in tle9012_node.block_voltage
//****************************************************************************
requestResult tle9012_convertBlockVoltage(uint8_t nodeID, uint8_t checkIfQueued){
	// If register is not ready or on error state return error
	if(checkRegisterReady_tle9012(nodeID, BVM, 0) != 1)
		return REQUEST_REGISTER_NOT_READY;
	else if(checkIfQueued == 1 && checkRegisterQueued_tle9012(nodeID, BVM, 0) == 1)
		return REQUEST_REGISTER_ALREADY_QUEUED;
	else if(checkRegisterError_tle9012(nodeID, BVM, 0) != 0)
		return REQUEST_ERROR;

	// Read register
	uint16_t blockVoltageRaw = 0;

	// Get result
	blockVoltageRaw = getRegisterCacheDataByIndex_tle9012(nodeID, BVM);

	// Convert register data
	tle9012_nodes[nodeID-1].block_voltage = (BVM_FSR/BVM_BIT_DIVIDER) * (double)blockVoltageRaw;

	//DEBUGPRINTF("tle9012_convertBlockVoltage: %.2f - R%d Q%d E%d\r\n", tle9012_nodes[nodeID-1].block_voltage, checkRegisterReady_tle9012(nodeID, BVM, 0), checkRegisterQueued_tle9012(nodeID, BVM, 0), checkRegisterError_tle9012(nodeID, BVM, 0));

	// Return ok
	return REQUEST_OK;
}

//****************************************************************************
// tle9012_convertTemperatures
//
// Read and convert all of the temperature sensor channels (0-3) and store result in tle9012_node item
// Note: TEMP_R, TEMP_INTC and TEMP_NOMINATOR must be adjusted if the
// default precision of 16bit changed or a different sensor is used.
// Note: The channel must be activated and the measurement must be triggered before it can be read
//
// node			-> The tle9012_node object representing one TLE9012 instance
// toSensIdx	-> The highest sensors index that shall be read (e.g. 2 reads sensor 0,1 and 2)
// checkIfQueued-> Will not perform the action if the used EXT_TEMP_x register is currently queued to be read
//
// Result is stored in tle9012_node.temperatures[cellsIdx]
//****************************************************************************
requestResult tle9012_convertTemperatures(uint8_t nodeID, uint8_t toSensIdx, uint8_t checkIfQueued){
	requestResult res = REQUEST_OK;
	requestResult returnRes = REQUEST_OK;

	// Check every sensor till up to toSensIdx
	for(uint8_t i = 0; i <= toSensIdx; i++){
		// Read cell data
		res = tle9012_convertTemperatureByIndex(nodeID, i, checkIfQueued);
		//printf("Update ETMP %d, %d\r\n", i, res); //checkRegisterReady_tle9012(nodeID, EXT_TEMP_0 + i, 0)
		// If result not OK and not marked as "old" (no new result) latch error till the end. This will only report the last error
		if(res != REQUEST_OK && res != REQUEST_REGISTER_DATA_INVALID_OR_OLD)
			res = returnRes;
	}

	return returnRes;
}

//****************************************************************************
// tle9012_convertTemperatureByIndex
//
// Read and convert one of the temperature sensor channels (0-3) and store result in tle9012_node item
// Note: TEMP_R, TEMP_INTC and TEMP_NOMINATOR must be adjusted if the
// default precision of 16bit changed or a different sensor is used.
// Note: The channel must be activated and the measurement must be triggered before it can be read
// Note: If the VALID flag of the temperature sensor is not set the error bit in the error bitmap is set
//
// node			-> The tle9012_node object representing one TLE9012 instance
// channelIdx	-> Index of the channel that shall be read
// checkIfQueued-> Will not perform the action if the used EXT_TEMP_x register is currently queued to be read
//
// Result is stored in tle9012_node.temperatures[cellsIdx]
//****************************************************************************
requestResult tle9012_convertTemperatureByIndex(uint8_t nodeID, uint8_t channelIdx, uint8_t checkIfQueued){
	// Get register index of requested temp register
	uint8_t reg_temp_idx = EXT_TEMP_0 + channelIdx;

	// If register is not ready or on error state return error
	if(checkRegisterReady_tle9012(nodeID, reg_temp_idx, 0) != 1)
		return REQUEST_REGISTER_NOT_READY;
	else if(checkIfQueued == 1 && checkRegisterQueued_tle9012(nodeID, reg_temp_idx, 0) == 1)
		return REQUEST_REGISTER_ALREADY_QUEUED;
	else if(checkRegisterError_tle9012(nodeID, reg_temp_idx, 0) != 0)
		return REQUEST_ERROR;

	// Get register result
	uint16_t tempRaw = getRegisterCacheDataByIndex_tle9012(nodeID, reg_temp_idx);

	// If valid bit is not set the data is old or invalid
	if((tempRaw & VALID__NEW_RESULT_STORED) == 0){
		// Mark register as error
		setRegisterError_tle9012(nodeID, reg_temp_idx, 0);
		return REQUEST_REGISTER_DATA_INVALID_OR_OLD;
	}

	// Extract INTC - internal current source power
	uint8_t ext_temp_z_INTC = (tempRaw & EXT_TEMP_0__INTC.mask) >> 10;

	// Extract result bits (assume same mask for all temp registers)
	tempRaw &= EXT_TEMP_0__RESULT.mask;

	// Convert register data to resistance value in kOhm
	double resistance = (((double)tempRaw * (TEMP_FSR * pow(4.0, ext_temp_z_INTC) ) ) / TEMP_DENOMINATOR - TEMP_R) /1000.0;

	// Convert resistance to temperature with interpolated lookup table
	tle9012_nodes[nodeID-1].temperatures[channelIdx] = interpLookupTable_tle9012(LT_NTC_10k, LT_NTC_10K_SIZE, resistance);

	//DEBUGPRINTF("%d -> %d INTC = %lf ohm = %lf C\r\n", getRegisterCacheDataByIndex_tle9012(nodeID, reg_temp_idx), ext_temp_z_INTC, resistance, tle9012_nodes[nodeID-1].temperatures[channelIdx]);
	//if(channelIdx == 4){
	//	printf("tempraw: %d\r\n", tempRaw);
	//	double res = interpLookupTableReverse_tle9012(LT_NTC_10k, LT_NTC_10K_SIZE, 25.0F);
	//	double raw = ((res*1000.0+TEMP_R)*TEMP_DENOMINATOR)/TEMP_NOMINATOR;
	//	printf("Res=%f raw=%f\r\n", res, raw);
	//}

	// Return ok
	return REQUEST_OK;
}

//****************************************************************************
// tle9012_convertExternalTemperatureThreshold -
//
// Used to convert the temperature threshold in Celsius to the format that need to be written to TEMP_CONF register
//****************************************************************************
uint16_t  tle9012_convertExternalTemperatureThreshold(double th_degree_C, uint8_t ext_temp_z_INTC){
	double e_tmp_th_resistance = interpLookupTableReverse_tle9012(LT_NTC_10k, LT_NTC_10K_SIZE, th_degree_C);
	double e_tmp_th_raw = ((e_tmp_th_resistance*1000.0+TEMP_R)*TEMP_DENOMINATOR)/(TEMP_FSR * pow(4.0, ext_temp_z_INTC) );
	//printf("Res=%f raw=%f\r\n", e_tmp_th_resistance, e_tmp_th_raw);

	// Limit to max and min if needed
	if(e_tmp_th_raw < 250){
		printf("convertExternalTemperatureThreshold: Calculated threshold turned out to be lower than 250. Use other ext_temp_z_INTC! %.2f\r\n", e_tmp_th_raw);
		return 250;
	}
	else if(e_tmp_th_raw > 800){
		printf("convertExternalTemperatureThreshold: Calculated threshold turned out to be higher than 800. Use other ext_temp_z_INTC! %.2f\r\n", e_tmp_th_raw);
		return 800;
	}
	else{
		return (uint16_t)e_tmp_th_raw;
	}
}

//****************************************************************************
// tle9012_convertInternalTemperatureByIndex
//
// Read and convert one of the two temperature sensor channels (0-1) and store result in tle9012_node item
// Note: TEMP_R, TEMP_INTC and TEMP_NOMINATOR must be adjusted if the
// default precision of 16bit changed or a different sensor is used.
// Note: If the VALID flag of the temperature sensor is not set the error bit in the error bitmap is set
//
// node			-> The tle9012_node object representing one TLE9012 instance
// channelIdx	-> Index of the channel that shall be read (0 or 1)
// checkIfQueued-> Will not perform the action if the used EXT_TEMP_x register is currently queued to be read
//
// Result is stored in tle9012_node.temperaturesInternal[cellsIdx]
//****************************************************************************
requestResult tle9012_convertInternalTemperatureByIndex(uint8_t nodeID, uint8_t channelIdx, uint8_t checkIfQueued){
	// Get register index of requested temp register
	uint16_t reg_temp_idx = 0;
	if(channelIdx == 0)
		reg_temp_idx = INT_TEMP;
	else if(channelIdx == 1)
		reg_temp_idx = INT_TEMP_2;
	else
		return REQUEST_ERROR;

	// If register is not ready or on error state return error
	if(checkRegisterReady_tle9012(nodeID, reg_temp_idx, 0) != 1)
		return REQUEST_REGISTER_NOT_READY;
	else if(checkIfQueued == 1 && checkRegisterQueued_tle9012(nodeID, reg_temp_idx, 0) == 1)
		return REQUEST_REGISTER_ALREADY_QUEUED;
	else if(checkRegisterError_tle9012(nodeID, reg_temp_idx, 0) != 0)
		return REQUEST_ERROR;


	// Get register result
	uint16_t tempRaw = getRegisterCacheDataByIndex_tle9012(nodeID, reg_temp_idx);

	// If valid bit is not set the data is old or invalid
	if((tempRaw & VALID__NEW_RESULT_STORED) == 0){
		// Mark register as error
		setRegisterError_tle9012(nodeID, reg_temp_idx, 0);
		return REQUEST_REGISTER_DATA_INVALID_OR_OLD;
	}

	// Extract result bits (assume same mask for all temp registers)
	tempRaw &= INT_TEMP__RESULT.mask;

	// Convert register data to temperature
	tle9012_nodes[nodeID-1].temperaturesInternal[channelIdx] = -TEMP_INT_LSB*(double)tempRaw+547.3;

