Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
	// Threshold calculation
	// (-TC + 547.3)/TEMP_INT_LSB = tempRaw

	// Return ok
	return REQUEST_OK;
}

//****************************************************************************
//TODO: Create convert function for SCVM, BAVM and AVM
//****************************************************************************



//****************************************************************************
// tle9012_printRegister - Print the register data and all its sub-registers separately in HEX, DEC and BIN
//
// nodeID		-> The ID of the node that shall be printed. Range 1 to TLE9012_NODES_SIZE
// reg_idx		-> The index of the register that shall be printed see register.h definitions.  E.g. PART_CONFIG etc
//****************************************************************************
void tle9012_printRegister(uint8_t nodeID, uint8_t reg_index)
{
    uint16_t reg_addr;
	const char *reg_name;
    //const char *bit_name;
	//int bit_num;

    if(reg_index >= 0 && reg_index <= NUM_REGISTERS)
    {
        reg_name = reg_items[reg_index].name;
        reg_addr = reg_items[reg_index].address;

        DEBUGPRINTF("\r\nRegister '%-16s' adr 0x%04X, idx %2d: 0x%04X\r\n", reg_name, reg_index, reg_addr, tle9012_nodes[nodeID-1].reg_data[reg_index]);

        // Check every subreg index till subregs of this register are done
        for(uint8_t subreg_idx = 0; subreg_idx < NUM_SUBREGISTERS-1; subreg_idx++){
        	// Stop iteration if wanted register is done, else print register
        	if(subreg_items[subreg_idx]->reg_index > reg_index){
        		break;
        	}
        	else if(subreg_items[subreg_idx]->reg_index == reg_index){
        		// Extract subreg data from register
        		uint16_t data = tle9012_nodes[nodeID-1].reg_data[reg_index];
        		data &= subreg_items[subreg_idx]->mask;

        		// Shift subreg data to LSB
        		uint16_t maskShifted = subreg_items[subreg_idx]->mask;
        		uint8_t numBitShift = 0;
        		for(numBitShift = 0; numBitShift <= 15; numBitShift++){
        			// Check if shift is done
        			if((maskShifted & 1) == 1){ break; }
        			// Shift bits
        			maskShifted = maskShifted >> 1;
        		}
        		// Shift data
        		uint16_t dataShifted = data >> numBitShift;

        		// Print data
        		DEBUGPRINTF("\tSubregister '%-18s' at %2d: 0x%04X | %6d | 0b", subreg_items[subreg_idx]->name, numBitShift, dataShifted, dataShifted);

        		/// Print data in binary
        		// Get the MSB of mask
        		uint16_t compare = 0b1000000000000000;
        		// Run backward through bits and print bit if it is in mask
        		for(int8_t numBit = 15; numBit >= 0; numBit--){
        			// Extract bit
        			uint16_t selectedBit = compare & subreg_items[subreg_idx]->mask;

        			// If the current bit is part of mask
        			if( selectedBit >= 1){
        				// If bit is a 1 write a one
        				if((data & selectedBit) == 0){
        					DEBUGPRINTF("0");
        				}
        				else{
        					DEBUGPRINTF("1");
        				}

        				//DEBUGPRINTF("A: %d %d %d %d\r\n",numBit, compare, selectedBit, data & selectedBit);
        			}

        			// Double compare to select next bit
        			compare = compare>>1;
        		}
        		DEBUGPRINTF("\r\n");
        	}

        }
    }
    else
    {
        DEBUGPRINTF("\r\n"); // new line
        DEBUGPRINTF("[ERROR]: Invalid register number");
    }
}


//****************************************************************************
// tle9012_printAllRegisters - Print all register data and all their sub-registers separately in HEX, DEC and BIN
//
// nodeID		-> The ID of the node that shall be printed. Range 1 to TLE9012_NODES_SIZE
//****************************************************************************
void tle9012_printAllRegisters(uint8_t nodeID)
{
	for(int i = 0; i < NUM_REGISTERS; i++){
		tle9012_printRegister(nodeID, i);
	}
	DEBUGPRINTF("\r\n");
}


//****************************************************************************
// tle9012_printStatusFlags - check failure bits in diagnosis registers and report failures to debug
//****************************************************************************
uint8_t last_GEN_DIAG;
void tle9012_printStatusFlags(uint8_t nodeID, uint8_t newLineForEachError, uint8_t onlyPrintIfDataChanged)
{
	uint16_t gen_diag_data = getRegisterCacheDataByIndex_tle9012(nodeID, GEN_DIAG);

	if((gen_diag_data & GEN_DIAG_RESETABLE_FLAGS) != 0 && (onlyPrintIfDataChanged == 0 || (onlyPrintIfDataChanged == 1 && last_GEN_DIAG != gen_diag_data))){
		if(newLineForEachError == 0)
			DEBUGPRINTF("[FAILURE]: TLE9012 -");


		if(gen_diag_data & PS_ERR_SLEEP__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" PS_ERR_SLEEP");
		}

		if(gen_diag_data & ADC_ERR__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" ADC_ERR");
		}

		if(gen_diag_data & OL_ERR__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" OL_ERR");
		}

		if(gen_diag_data & INT_IC_ERR__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" INT_IC_ERR");
		}

		if(gen_diag_data & REG_CRC_ERR__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" REG_CRC_ERR");
		}

		if(gen_diag_data & EXT_T_ERR__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" EXT_T_ERR");
		}

		if(gen_diag_data & INT_OT__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" INT_OT");
		}

		if(gen_diag_data & CELL_UV__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" CELL_UV");
		}

		if(gen_diag_data & CELL_OV__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" CELL_OV");
		}

		if(gen_diag_data & BAL_ERR_UC__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" BAL_ERR_UC");
		}

