Infineon/IMR_PSoC6_BMS/proj_cm4/BMS_TLE9012/BMS_TLE9012.c
		if(gen_diag_data & BAL_ERR_OC__ERR_OCCURED){
			if(newLineForEachError)DEBUGPRINTF("\r\n[FAILURE]: ");
			DEBUGPRINTF(" BAL_ERR_OC");
		}

		DEBUGPRINTF("\r\n");

		// Store last state of registers
		last_GEN_DIAG = gen_diag_data;
	}
}


//****************************************************************************
// tle9012_isProblemDetected - Check problem flags in diagnosis registers and
// Return 1 if the library detected a logic failure or
// Return 2 if a TLE9012 reported a fail in general diagnostic register (automatically returned by every write to a register)
//****************************************************************************
uint8_t tle9012_isProblemDetected(){
	// If any error was detected return its code
	if(tle9012_problemDetected == 1 )
		return 1;
	else if(generalDiagnosticProblemDetected == 1)
		return 2;

	// Else return 0
	return 0;
}
//****************************************************************************
// tle9012_clearProblemDetected - Clear all problem flags
// (library logic failure and TLE9012 fail in general diagnostic register (automatically checked/set every write to a register)
//****************************************************************************
void    tle9012_clearProblemDetected(){
	tle9012_problemDetected = 0;
	generalDiagnosticProblemDetected = 0;
}








//****************************************************************************
// tle9012_getFailureBitmap
//
// Get a uint32 with all set failure bits
//****************************************************************************
uint32_t tle9012_getFailureBitmap(uint8_t nodeID){
	uint32_t bitmap = 0;
	uint16_t gen_diag_data = getRegisterCacheDataByIndex_tle9012(nodeID, GEN_DIAG);

	if(gen_diag_data & OL_ERR__ERR_OCCURED)
		bitmap |= Fail_SYS_OL_ERR;

	if(gen_diag_data & INT_IC_ERR__ERR_OCCURED)
		bitmap |= Fail_SYS_INT_IC_ERR;

	if(gen_diag_data & REG_CRC_ERR__ERR_OCCURED)
		bitmap |= Fail_SYS_REG_CRC_ERR;

	if(gen_diag_data & EXT_T_ERR__ERR_OCCURED)
		bitmap |= Fail_SYS_EXT_T_ERR;

	if(gen_diag_data & INT_OT__ERR_OCCURED)
		bitmap |= Fail_SYS_INT_OT;

	if(gen_diag_data & CELL_UV__ERR_OCCURED)
		bitmap |= Fail_SYS_CELL_UV;

	if(gen_diag_data & CELL_OV__ERR_OCCURED)
		bitmap |= Fail_SYS_CELL_OV;

	if(gen_diag_data & BAL_ERR_UC__ERR_OCCURED)
		bitmap |= Fail_SYS_BAL_ERR_UC;

	if(gen_diag_data & BAL_ERR_OC__ERR_OCCURED)
		bitmap |= Fail_SYS_BAL_ERR_OC;

	if(gen_diag_data & PS_ERR_SLEEP__ERR_OCCURED)
		bitmap |= Fail_SYS_PS_ERR_SLEEP;

	if(gen_diag_data & ADC_ERR__ERR_OCCURED)
		bitmap |= Fail_SYS_ADC_ERR;

	return bitmap;
}

//****************************************************************************
// tle9012_isFailureFlagActive
//
// Check specific failure bits in diagnosis registers and return state
//****************************************************************************
uint8_t tle9012_isFailureFlagActive(uint8_t nodeID, FailureFlags_tle9012 Fail){
	uint16_t gen_diag_data = getRegisterCacheDataByIndex_tle9012(nodeID, GEN_DIAG);


	switch(Fail){
		case Fail_SYS_PS_ERR_SLEEP:
			if(gen_diag_data & PS_ERR_SLEEP__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_ADC_ERR:
			if(gen_diag_data & ADC_ERR__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_OL_ERR:
			if(gen_diag_data & OL_ERR__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_INT_IC_ERR:
			if(gen_diag_data & INT_IC_ERR__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_REG_CRC_ERR:
			if(gen_diag_data & REG_CRC_ERR__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_EXT_T_ERR:
			if(gen_diag_data & EXT_T_ERR__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_INT_OT:
			if(gen_diag_data & INT_OT__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_CELL_UV:
			if(gen_diag_data & CELL_UV__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_CELL_OV:
			if(gen_diag_data & CELL_OV__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_BAL_ERR_UC:
			if(gen_diag_data & BAL_ERR_UC__ERR_OCCURED)
				return 1;
			break;
		case Fail_SYS_BAL_ERR_OC:
			if(gen_diag_data & BAL_ERR_OC__ERR_OCCURED)
				return 1;
			break;
	}

	return 0;
}














